# 数据聚合和分组运算

In [1]:
import numpy as np
from numpy import NaN as NA
import pandas as pd
from numpy.random import randn
from numpy.linalg import inv,qr, eig ,det ,svd

import matplotlib.pyplot as plt
import random

from pandas import DataFrame , Series

In [22]:
df = DataFrame({ 'key1':list('aabba'),
                'key2':'one,two,one,two,one'.split(','),
                'data1':np.random.randn(5),
                'data2':np.random.randn(5)
            
})

In [4]:
df

      data1     data2 key1 key2
0 -0.882622 -0.259932    a  one
1  0.542232 -0.217811    a  two
2 -1.931732  0.008450    b  one
3 -0.199144  0.240973    b  two
4  0.195455  0.062002    a  one

In [5]:
grouped = df['data1'].groupby(df['key1'])

In [6]:
grouped

In [8]:
grouped.mean()

key1
a   -0.048311
b   -1.065438
Name: data1, dtype: float64

In [9]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [10]:
means

key1  key2
a     one    -0.343583
      two     0.542232
b     one    -1.931732
      two    -0.199144
Name: data1, dtype: float64

In [11]:
means.unstack()

key2       one       two
key1
a    -0.343583  0.542232
b    -1.931732 -0.199144

In [14]:
states = np.array('Ohio,Calfornia,California,Ohio,Ohio'.split(','))

In [17]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [18]:
df['data1'].groupby([states, years]).mean()

Calfornia   2005    0.542232
California  2006   -1.931732
Ohio        2005   -0.540883
            2006    0.195455
Name: data1, dtype: float64

In [19]:
df

      data1     data2 key1 key2
0 -0.882622 -0.259932    a  one
1  0.542232 -0.217811    a  two
2 -1.931732  0.008450    b  one
3 -0.199144  0.240973    b  two
4  0.195455  0.062002    a  one

In [20]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.048311 -0.138580
b    -1.065438  0.124711

In [21]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.343583 -0.098965
     two   0.542232 -0.217811
b    one  -1.931732  0.008450
     two  -0.199144  0.240973

In [22]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

## 对分组进行迭代

In [23]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0 -0.882622 -0.259932    a  one
1  0.542232 -0.217811    a  two
4  0.195455  0.062002    a  one
b
      data1     data2 key1 key2
2 -1.931732  0.008450    b  one
3 -0.199144  0.240973    b  two

In [24]:
for (k1, k2), group in df.groupby('key1,key2'.split(',')):
    print(k1,k2)
    print(group)
    print('=========')

a one
      data1     data2 key1 key2
0 -0.882622 -0.259932    a  one
4  0.195455  0.062002    a  one
=========
a two
      data1     data2 key1 key2
1  0.542232 -0.217811    a  two
=========
b one
      data1    data2 key1 key2
2 -1.931732  0.00845    b  one
=========
b two
      data1     data2 key1 key2
3 -0.199144  0.240973    b  two
=========

In [25]:
pieces =dict(list(df.groupby(['key1'])))

In [26]:
pieces['b']

      data1     data2 key1 key2
2 -1.931732  0.008450    b  one
3 -0.199144  0.240973    b  two

In [27]:
list(df.groupby(['key1']))

[('a',       data1     data2 key1 key2
  0 -0.882622 -0.259932    a  one
  1  0.542232 -0.217811    a  two
  4  0.195455  0.062002    a  one), ('b',       data1     data2 key1 key2
  2 -1.931732  0.008450    b  one
  3 -0.199144  0.240973    b  two)]

In [29]:
dict([('a', 'n')])

{'a': 'n'}

In [30]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [31]:
grouped = df.groupby(df.dtypes, axis = 1)

In [32]:
dict(list(grouped))

{dtype('float64'):       data1     data2
 0 -0.882622 -0.259932
 1  0.542232 -0.217811
 2 -1.931732  0.008450
 3 -0.199144  0.240973
 4  0.195455  0.062002, dtype('O'):   key1 key2
 0    a  one
 1    a  two
 2    b  one
 3    b  two
 4    a  one}

In [33]:
df

      data1     data2 key1 key2
0 -0.882622 -0.259932    a  one
1  0.542232 -0.217811    a  two
2 -1.931732  0.008450    b  one
3 -0.199144  0.240973    b  two
4  0.195455  0.062002    a  one

In [34]:
grouped.mean()

DataError: No numeric types to aggregate

## 选取一个或者一组列

In [35]:
df.groupby('key1')['data1']

In [36]:
df.groupby('key1')[['data2']]

In [37]:
df.groupby('key1')['data1'].mean()

key1
a   -0.048311
b   -1.065438
Name: data1, dtype: float64

In [38]:
df.groupby('key1')[['data2']].mean()

         data2
key1
a    -0.138580
b     0.124711

In [39]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [40]:
s_grouped

In [41]:
s_grouped.mean()

key1  key2
a     one    -0.098965
      two    -0.217811
b     one     0.008450
      two     0.240973
Name: data2, dtype: float64

## 通过字典和Series进行分组

In [2]:
people = DataFrame(np.random.randn(5, 5),
                   columns=list('abcde'),
                   index='Joe,Steve,Wes,Jim,Travis'.split(',')

)

In [3]:
people

               a         b         c         d         e
Joe    -0.366814 -0.836680 -0.526578  0.802915 -0.387401
Steve   1.362283 -1.035942  0.652969  0.263546  1.519637
Wes     0.696230 -0.070523 -0.347818 -0.697652 -0.530789
Jim     0.511164  1.200349  1.006598 -0.838393 -0.931405
Travis -1.144632  0.649295  0.369711  0.219935 -0.189562

In [4]:
people.loc[2:3, list('bc')] = np.nan

In [5]:
people

               a         b         c         d         e
Joe    -0.366814 -0.836680 -0.526578  0.802915 -0.387401
Steve   1.362283 -1.035942  0.652969  0.263546  1.519637
Wes     0.696230       NaN       NaN -0.697652 -0.530789
Jim     0.511164  1.200349  1.006598 -0.838393 -0.931405
Travis -1.144632  0.649295  0.369711  0.219935 -0.189562

In [6]:
mapping = {
    'a':'red',
    'b':'red',
    'c':'blue',
    'b':'blue',
    'e':'red',
    'f':'orange',
    
}

In [7]:
by_column = people.groupby(mapping, axis=1)

In [8]:
by_column.sum()

            blue       red
Joe    -1.363258 -0.754215
Steve  -0.382973  2.881920
Wes          NaN  0.165441
Jim     2.206947 -0.420241
Travis  1.019007 -1.334194

In [9]:
map_series = Series(mapping)

In [10]:
map_series

a       red
b      blue
c      blue
e       red
f    orange
dtype: object

In [11]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    2
Steve      2    2
Wes        0    2
Jim        2    2
Travis     2    2

## 通过函数进行分组

In [12]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.840580  0.363668  0.480020 -0.733129 -1.849595
5  1.362283 -1.035942  0.652969  0.263546  1.519637
6 -1.144632  0.649295  0.369711  0.219935 -0.189562

In [13]:
people

               a         b         c         d         e
Joe    -0.366814 -0.836680 -0.526578  0.802915 -0.387401
Steve   1.362283 -1.035942  0.652969  0.263546  1.519637
Wes     0.696230       NaN       NaN -0.697652 -0.530789
Jim     0.511164  1.200349  1.006598 -0.838393 -0.931405
Travis -1.144632  0.649295  0.369711  0.219935 -0.189562

## 根据索引级别进行分组

In [16]:
columns = pd.MultiIndex.from_arrays([
    'US,US,US,JP,JP'.split(','),
    [1, 3, 5, 1, 3]],
    names = ['cty', 'tenor']


)

In [17]:
columns

MultiIndex(levels=[['JP', 'US'], [1, 3, 5]],
           labels=[[1, 1, 1, 0, 0], [0, 1, 2, 0, 1]],
           names=['cty', 'tenor'])

In [18]:
hier_df = DataFrame(np.random.randn(4, 5), columns = columns)

In [19]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.224652 -1.370419 -0.777069  0.737330  0.579823
1     -1.277420 -0.561034 -0.561933 -1.262355  0.514231
2      0.029970  1.100572 -1.260756 -1.655847 -0.653253
3     -1.011838  0.116315  1.784830 -0.286759 -0.073210

In [20]:
hier_df.groupby(level='cty', axis =1 ).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

## 数据聚合

In [23]:
df

      data1     data2 key1 key2
0  0.184353  1.131514    a  one
1  0.985642 -0.603604    a  two
2  0.595889 -0.584031    b  one
3 -1.397768  0.365621    b  two
4  0.018473 -0.857870    a  one

In [24]:
grouped = df.groupby('key1')

In [25]:
grouped

In [27]:
grouped['data1']

In [26]:
grouped['data1'].quantile(0.9)

key1
a    0.825384
b    0.396523
Name: data1, dtype: float64

In [28]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [29]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.967169  1.989384
b     1.993658  0.949652

In [30]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.396156  0.517204  0.018473  0.101413  0.184353  0.584997
b      2.0 -0.400940  1.409729 -1.397768 -0.899354 -0.400940  0.097475

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.985642   3.0 -0.109987  1.082662 -0.857870 -0.730737 -0.603604
b     0.595889   2.0 -0.109205  0.671505 -0.584031 -0.346618 -0.109205


           75%       max
key1
a     0.263955  1.131514
b     0.128208  0.365621

In [31]:
! ll

/bin/sh: 1: ll: not found

In [32]:
! ls

arr.txt
chapter1_data.txt
comparison of NaN from numpy and None from Python.ipynb
contain_duplicate_columns.csv
df_to_df.ipynb
dual_test_npy.npz
foods-2011-10-03.json
Haiti.csv
how to use DataFrame.loc to select columns&rows assigned AND compare boolean.ipynb
joined_by_contain_duplicate_columns.csv
macrodata.csv
movies.dat
names
NaN_behavior_in_merge.ipynb
pandas_contain_duplicate_columns.ipynb
PortAuPrince_Roads
Python_data_analysis_chapter_1.ipynb
Python_data_analysis_chapter_2.ipynb
Python_data_analysis_chapter_3.ipynb
Python_data_analysis_chapter_4.ipynb
Python_data_analysis_chapter_6.ipynb
Python_data_analysis_chapter_7.ipynb
Python_data_analysis_chapter_8.ipynb
Python_data_analysis_chapter_9.ipynb
ratings.dat
README
spx.csv
test_npy.npy
three_shape1.svg
three_shape2.svg
tips.csv
users.dat

In [34]:
tips = pd.read_csv('tips.csv')

In [36]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [37]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [39]:
tips.head()

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

## 面向列的多函数应用

In [40]:
grouped = tips.groupby(['sex', 'smoker'])

In [41]:
grouped_pct = grouped['tip_pct']

In [42]:
grouped_pct.agg('mean')

sex     smoker
Female  No        0.156921
        Yes       0.182150
Male    No        0.160669
        Yes       0.152771
Name: tip_pct, dtype: float64

In [43]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                   mean       std  peak_to_peak
sex    smoker
Female No      0.156921  0.036421      0.195876
       Yes     0.182150  0.071595      0.360233
Male   No      0.160669  0.041849      0.220186
       Yes     0.152771  0.090588      0.674707

In [44]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                    foo       bar
sex    smoker
Female No      0.156921  0.036421
       Yes     0.182150  0.071595
Male   No      0.160669  0.041849
       Yes     0.152771  0.090588

In [47]:
funtions = 'count,mean,max'.split(',')

In [48]:
result = grouped['tip_pct', 'total_bill'].agg(funtions)

In [49]:
result

              tip_pct                     total_bill
                count      mean       max      count       mean    max
sex    smoker
Female No          54  0.156921  0.252672         54  18.105185  35.83
       Yes         33  0.182150  0.416667         33  17.977879  44.30
Male   No          97  0.160669  0.291990         97  19.791237  48.33
       Yes         60  0.152771  0.710345         60  22.284500  50.81

In [50]:
result['tip_pct']

               count      mean       max
sex    smoker
Female No         54  0.156921  0.252672
       Yes        33  0.182150  0.416667
Male   No         97  0.160669  0.291990
       Yes        60  0.152771  0.710345

In [52]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]

In [53]:
grouped['tip_pct', 'total_bill'].agg(ftuples)

                   tip_pct              total_bill
              Durchschnitt Abweichung Durchschnitt Abweichung
sex    smoker
Female No         0.156921   0.001327    18.105185  53.092422
       Yes        0.182150   0.005126    17.977879  84.451517
Male   No         0.160669   0.001751    19.791237  76.152961
       Yes        0.152771   0.008206    22.284500  98.244673

### 对不同的列应用不同的函数

In [54]:
grouped.agg({'tip':np.max, 'size':'sum'})

                tip  size
sex    smoker
Female No       5.2   140
       Yes      6.5    74
Male   No       9.0   263
       Yes     10.0   150

In [55]:
grouped.agg({
    'tip_pct':'min,max,mean,std'.split(','),
    'size':'sum'
})

                tip_pct                               size
                    min       max      mean       std  sum
sex    smoker
Female No      0.056797  0.252672  0.156921  0.036421  140
       Yes     0.056433  0.416667  0.182150  0.071595   74
Male   No      0.071804  0.291990  0.160669  0.041849  263
       Yes     0.035638  0.710345  0.152771  0.090588  150

## 以“无索引”的形式返回聚合数据

In [56]:
tips.groupby('sex,smoker'.split(','), as_index = False).mean()

      sex smoker  total_bill       tip      size   tip_pct
0  Female     No   18.105185  2.773519  2.592593  0.156921
1  Female    Yes   17.977879  2.931515  2.242424  0.182150
2    Male     No   19.791237  3.113402  2.711340  0.160669
3    Male    Yes   22.284500  3.051167  2.500000  0.152771

# 分组级运算和转换

In [59]:
df

      data1     data2 key1 key2
0  0.184353  1.131514    a  one
1  0.985642 -0.603604    a  two
2  0.595889 -0.584031    b  one
3 -1.397768  0.365621    b  two
4  0.018473 -0.857870    a  one

In [61]:
k1_means = df.groupby('key1').mean().add_prefix('mean_')

In [62]:
k1_means

      mean_data1  mean_data2
key1
a       0.396156   -0.109987
b      -0.400940   -0.109205

In [63]:
pd.merge(df, k1_means, left_on='key1', right_index=True)

      data1     data2 key1 key2  mean_data1  mean_data2
0  0.184353  1.131514    a  one    0.396156   -0.109987
1  0.985642 -0.603604    a  two    0.396156   -0.109987
4  0.018473 -0.857870    a  one    0.396156   -0.109987
2  0.595889 -0.584031    b  one   -0.400940   -0.109205
3 -1.397768  0.365621    b  two   -0.400940   -0.109205

In [64]:
key = 'one,two,one,two,one'.split(',')

In [65]:
people

               a         b         c         d         e
Joe    -0.366814 -0.836680 -0.526578  0.802915 -0.387401
Steve   1.362283 -1.035942  0.652969  0.263546  1.519637
Wes     0.696230       NaN       NaN -0.697652 -0.530789
Jim     0.511164  1.200349  1.006598 -0.838393 -0.931405
Travis -1.144632  0.649295  0.369711  0.219935 -0.189562

In [67]:
people.groupby(key).mean()

            a         b         c         d         e
one -0.271739 -0.093692 -0.078433  0.108400 -0.369251
two  0.936724  0.082203  0.829784 -0.287423  0.294116

In [68]:
people.groupby(key).transform(np.mean)

               a         b         c         d         e
Joe    -0.271739 -0.093692 -0.078433  0.108400 -0.369251
Steve   0.936724  0.082203  0.829784 -0.287423  0.294116
Wes    -0.271739 -0.093692 -0.078433  0.108400 -0.369251
Jim     0.936724  0.082203  0.829784 -0.287423  0.294116
Travis -0.271739 -0.093692 -0.078433  0.108400 -0.369251

In [69]:
def demean(arr):
    return arr - arr.mean()

In [70]:
demeaned = people.groupby(key).transform(demean)

In [72]:
demeaned

               a         b         c         d         e
Joe    -0.095076 -0.742988 -0.448145  0.694516 -0.018150
Steve   0.425559 -1.118146 -0.176814  0.550969  1.225521
Wes     0.967969       NaN       NaN -0.806051 -0.161539
Jim    -0.425559  1.118146  0.176814 -0.550969 -1.225521
Travis -0.872893  0.742988  0.448145  0.111535  0.179689

In [75]:
demeaned.groupby(key).mean()

                a    b             c    d    e
one  3.700743e-17  0.0  0.000000e+00  0.0  0.0
two  0.000000e+00  0.0  5.551115e-17  0.0  0.0